---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPerTreadNumber
source: html/978bfaf4-b0f8-7af5-1147-cee9c6817865.htm
---
# Autodesk.Revit.DB.Architecture.BalusterPlacement.BalusterPerTreadNumber Property

The number of balusters per tread.

## Syntax (C#)
```csharp
public int BalusterPerTreadNumber { get; set; }
```

## Remarks
Applicable only if UseBalusterPerTreadOnStairs is true.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for balusterPerTreadNumber is not positive.